Revit 2024 API
IFCLinkDocumentExportScope Constructor
 Instantiates a default IFCLinkDocumentExportScope object.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public IFCLinkDocumentExportScope(
	Document pADoc
)
Visual Basic
Public Sub New ( _
	pADoc As Document _
)
Visual C++
public:
IFCLinkDocumentExportScope(
	Document^ pADoc
)
Parameters
pADoc
Type: Autodesk.Revit.DB.Document
 The linked document to export.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
IFCLinkDocumentExportScope Class
Autodesk.Revit.DB.IFC Namespace